{"id":"electrical-checklist-2023","version":"v2","name":"2023 Electrical Checklist","sections":[{"id":"pre-inspection","title":"Pre-Inspection","items":[{"id":"pre-1","text":"Verify power disconnect is locked out","type":"checkbox","details":"Before starting work, ensure the main power disconnect is locked out and tagged so that the panel can be worked on safely and no one can re-energize it during the inspection."},{"id":"pre-2","text":"Confirm voltage levels at panel","type":"checkbox","details":"Confirm the voltage at the panel (e.g. 120/208 V, 347/600 V) so that the correct test equipment and PPE are used and the single-line diagram can be verified."},{"id":"pre-3","text":"Review single-line diagram","type":"checkbox","details":"Review the single-line diagram before testing so that you understand the system layout, feeder sources, and protective devices and can verify them against the installation."}]},{"id":"terminals","title":"Terminals & Connections","items":[{"id":"term-1","text":"Torque check on main lugs","type":"checkbox","details":"Perform a torque check on main lugs per manufacturer specifications to ensure connections are tight. Loose connections can overheat and cause failure or fire."},{"id":"term-2","text":"Thermal scan of connections","type":"checkbox","details":"Use a thermal imaging camera or similar to scan connections under load. Hot spots indicate loose or failing connections that should be corrected."},{"id":"term-3","text":"Ground continuity verified","type":"checkbox","details":"Verify that grounding and bonding connections are continuous and secure so that fault current has a reliable path and touch voltage is controlled."}]},{"id":"protection","title":"Protection & Coordination","items":[{"id":"prot-1","text":"Breaker settings documented","type":"checkbox","details":"Document all breaker settings (trip, delay, etc.) so that coordination can be verified and future changes can be compared to the as-built condition."},{"id":"prot-2","text":"Arc flash labels current","type":"checkbox","details":"Ensure arc flash labels reflect the current system configuration and fault current so that workers have accurate incident energy and PPE information."},{"id":"prot-3","text":"Coordination study on file","type":"checkbox","details":"Keep the coordination study on file so that selective coordination can be verified and future modifications can be checked against the study."},{"id":"prot-4","text":"Arc flash verification step","type":"checkbox","details":"Verify arc flash calculations and labels against the installed system so that PPE and approach boundaries remain correct after any changes."}]}]}
